Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BlindHoleDepth Property
 Gets or sets the blind hole depth.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double BlindHoleDepth { get; set; }
Public Property BlindHoleDepth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace